app/controllers/movies_controller.rb

    def index

      @all_ratings = Movie.select("DISTINCT(rating)").order("rating").map{|entry| entry.rating}
      @checked_dict = {}
      @sort_by = nil

      # if params[:prev_checked_dict]
      #   p "Prev_checked"
      #   p params[:prev_checked_dict]
      #   # @checked_dict = params[:prev_checked_dict]
      #   @checked_dict = Hash[params[:prev_checked_dict].map { |k,v| [k, ActiveRecord::Type::Boolean.new.type_cast_from_user(v) ]}]
      # end

      if params["ratings"]
        @checked_array = @all_ratings.map{|rating| params["ratings"][rating]}
---
SELECT DISTINCT(rating) FROM "movies"  ORDER BY rating
SELECT "movies".* FROM "movies"  ORDER BY release_date